In [1]:
import pandas as pd

In [22]:
df = pd .read_csv('GlobalLandTemperaturesByCity.csv')

In [23]:
df

                 dt  AverageTemperature  ...  Latitude Longitude
0        1743-11-01               6.068  ...    57.05N    10.33E
1        1743-12-01                 NaN  ...    57.05N    10.33E
2        1744-01-01                 NaN  ...    57.05N    10.33E
3        1744-02-01                 NaN  ...    57.05N    10.33E
4        1744-03-01                 NaN  ...    57.05N    10.33E
...             ...                 ...  ...       ...       ...
2686734  1989-06-01              27.839  ...    23.31N   112.72E
2686735  1989-07-01              29.038  ...    23.31N   112.72E
2686736  1989-08-01              29.231  ...    23.31N   112.72E
2686737  1989-09-01              27.958  ...    23.31N   112.72E
2686738  1989-10-01              24.576  ...       NaN       NaN

[2686739 rows x 7 columns]

In [144]:
temp_alt = df[['AverageTemperature','Latitude']].dropna()
temp_alt

         AverageTemperature Latitude
0                     6.068   57.05N
5                     5.788   57.05N
6                    10.644   57.05N
7                    14.051   57.05N
8                    16.082   57.05N
...                     ...      ...
2686733              25.058   23.31N
2686734              27.839   23.31N
2686735              29.038   23.31N
2686736              29.231   23.31N
2686737              27.958   23.31N

[2567904 rows x 2 columns]

In [147]:
d = temp_alt.groupby('Latitude').mean()
d = d.rename(columns = {"AverageTemperature":"avg_lat"})

In [151]:
new_data = temp_alt.set_index('Latitude').join(d)
new_data

          AverageTemperature    avg_lat
Latitude
0.80N                 24.890  24.189998
0.80N                 27.070  24.189998
0.80N                 26.455  24.189998
0.80N                 25.753  24.189998
0.80N                 26.292  24.189998
...                      ...        ...
8.84S                 25.290  23.847313
8.84S                 23.856  23.847313
8.84S                 22.688  23.847313
8.84S                 21.567  23.847313
8.84S                 21.770  23.847313

[2567904 rows x 2 columns]

In [166]:
sample = new_data.sample(n=100, random_state=1)

In [165]:
from scipy.stats import chisquare
chisquare(sample['AverageTemperature'], sample['avg_lat'])

Power_divergenceResult(statistic=175.0281180153032, pvalue=4.624186183532578e-16)